Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH01/edc/PIC32CM2532JH01032.PIC
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG21" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x41000055">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG22" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x41000056">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG23" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x41000057">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG24" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x41000058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG25" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x41000059">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG26" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4100005A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG27" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4100005B">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG28" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4100005C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG29" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4100005D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG30" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4100005E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PINCFG31" edc:nzwidth="0x8" edc:access="-n---nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x47" edc:_addr="0x4100005F">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:nzwidth="0x1" edc:desc="Peripheral Multiplexer Enable"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:nzwidth="0x1" edc:desc="Input Enable"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:nzwidth="0x1" edc:desc="Pull Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:nzwidth="0x1" edc:desc="Output Driver Strength Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1FA0" edc:_addr="0x41000060"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CTRL" edc:nzwidth="0x8" edc:access="---w-w-w" edc:por="00000000" edc:mclr="00000000" edc:impl="0x15" edc:_addr="0x41002000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC" edc:nzwidth="0x1" edc:desc="32-bit Cyclic Redundancy Code"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CE" edc:nzwidth="0x1" edc:desc="Chip-Erase"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="STATUSA" edc:nzwidth="0x8" edc:access="---nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1F" edc:_addr="0x41002001">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Done"/>
            <edc:SFRFieldDef edc:cname="CRSTEXT" edc:nzwidth="0x1" edc:desc="CPU Reset Phase Extension"/>
            <edc:SFRFieldDef edc:cname="BERR" edc:nzwidth="0x1" edc:desc="Bus Error"/>
            <edc:SFRFieldDef edc:cname="FAIL" edc:nzwidth="0x1" edc:desc="Failure"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:nzwidth="0x1" edc:desc="Protection Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
