Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH01/edc/PIC32CM2532JH01032.PIC
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="STATUSB" edc:nzwidth="0x8" edc:access="--rrrrrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x41002002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PROT" edc:nzwidth="0x1" edc:desc="Protected"/>
            <edc:SFRFieldDef edc:cname="DBGPRES" edc:nzwidth="0x1" edc:desc="Debugger Present"/>
            <edc:SFRFieldDef edc:cname="DCCD0" edc:nzwidth="0x1" edc:desc="Debug Communication Channel 0 Dirty"/>
            <edc:SFRFieldDef edc:cname="DCCD1" edc:nzwidth="0x1" edc:desc="Debug Communication Channel 1 Dirty"/>
            <edc:SFRFieldDef edc:cname="HPE" edc:nzwidth="0x1" edc:desc="Hot-Plugging Enable"/>
            <edc:SFRFieldDef edc:cname="CEHL" edc:nzwidth="0x1" edc:desc="Chip Erase Hard Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x41002003"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="ADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="AMOD" edc:nzwidth="0x2" edc:desc="Access Mode"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x1E" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="LENGTH" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFC" edc:_addr="0x41002008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:nzwidth="0x1E" edc:desc="Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DATA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100200C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DCC0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DCC1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="DID" edc:nzwidth="0x20" edc:access="rrrrrrrrr-rrrrrrrrrrrrrrrrrrrrrr" edc:por="00010001000001100000000100000111" edc:mclr="00010001000001100000000100000111" edc:impl="0xFFBFFFFF" edc:_addr="0x41002018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:nzwidth="0x8" edc:desc="Device Select">
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_100PIN_CAN" edc:desc="512 KB Flash / 64 KB SRAM / 100-pin / CAN" edc:when="(field &amp; 0xFF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_64PIN_CAN" edc:desc="512 KB Flash / 64 KB SRAM / 64-pin / CAN" edc:when="(field &amp; 0xFF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_48PIN_CAN" edc:desc="512 KB Flash / 64 KB SRAM / 48-pin / CAN" edc:when="(field &amp; 0xFF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_32PIN_CAN" edc:desc="512 KB Flash / 64 KB SRAM / 32-pin / CAN" edc:when="(field &amp; 0xFF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_100PIN_CAN" edc:desc="256 KB Flash / 32 KB SRAM / 100-pin / CAN" edc:when="(field &amp; 0xFF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_64PIN_CAN" edc:desc="256 KB Flash / 32 KB SRAM / 64-pin / CAN" edc:when="(field &amp; 0xFF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_48PIN_CAN" edc:desc="256 KB Flash / 32 KB SRAM / 48-pin / CAN" edc:when="(field &amp; 0xFF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_32PIN_CAN" edc:desc="256 KB Flash / 32 KB SRAM / 32-pin / CAN" edc:when="(field &amp; 0xFF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_100PIN_NOCAN" edc:desc="256 KB Flash / 32 KB SRAM / 100-pin / No CAN" edc:when="(field &amp; 0xFF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_100PIN_NOCAN" edc:desc="512 KB Flash / 64 KB SRAM / 100-pin / No CAN" edc:when="(field &amp; 0xFF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_64PIN_NOCAN" edc:desc="512 KB Flash / 64 KB SRAM / 64-pin / No CAN" edc:when="(field &amp; 0xFF) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_64PIN_NOCAN" edc:desc="256 KB Flash / 32 KB SRAM / 64-pin / No CAN" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_48PIN_NOCAN" edc:desc="256 KB Flash / 32 KB SRAM / 48-pin / No CAN" edc:when="(field &amp; 0xFF) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_48PIN_NOCAN" edc:desc="512 KB Flash / 64 KB SRAM / 48-pin / No CAN" edc:when="(field &amp; 0xFF) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="512KB_64KB_32PIN_NOCAN" edc:desc="512 KB Flash / 64 KB SRAM / 32-pin / No CAN" edc:when="(field &amp; 0xFF) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="256KB_32KB_32PIN_NOCAN" edc:desc="256 KB Flash / 32 KB SRAM / 32-pin / No CAN" edc:when="(field &amp; 0xFF) == 0x16"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REVISION" edc:nzwidth="0x4" edc:desc="Revision Number"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:nzwidth="0x4" edc:desc="Die Number"/>
            <edc:SFRFieldDef edc:cname="SERIES" edc:nzwidth="0x6" edc:desc="Series">
              <edc:SFRFieldSemantic edc:cname="JH00_JH01" edc:desc="PIC32CM JH00 and PIC32CM JH01" edc:when="(field &amp; 0x3F) == 6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FAMILY" edc:nzwidth="0x5" edc:desc="Family">
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="5V Industrial" edc:when="(field &amp; 0x1F) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PROCESSOR" edc:nzwidth="0x4" edc:desc="Processor">
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Cortex-M0+" edc:when="(field &amp; 0xF) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xE4" edc:_addr="0x4100201C"/>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="CTRL" edc:nzwidth="0x8" edc:access="---w-w-w" edc:por="00000000" edc:mclr="00000000" edc:impl="0x15" edc:_addr="0x41002100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC" edc:nzwidth="0x1" edc:desc="32-bit Cyclic Redundancy Code"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CE" edc:nzwidth="0x1" edc:desc="Chip-Erase"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DSU" edc:cname="STATUSA" edc:nzwidth="0x8" edc:access="---nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1F" edc:_addr="0x41002101">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DONE" edc:nzwidth="0x1" edc:desc="Done"/>
            <edc:SFRFieldDef edc:cname="CRSTEXT" edc:nzwidth="0x1" edc:desc="CPU Reset Phase Extension"/>
            <edc:SFRFieldDef edc:cname="BERR" edc:nzwidth="0x1" edc:desc="Bus Error"/>
            <edc:SFRFieldDef edc:cname="FAIL" edc:nzwidth="0x1" edc:desc="Failure"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:nzwidth="0x1" edc:desc="Protection Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
