Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH01/edc/PIC32CM2532JH01032.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TDCR" edc:nzwidth="0x20" edc:access="-----------------nnnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F7F" edc:_addr="0x42001C48">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TDCF" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Filter Length"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCO" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x42001C4C"/>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="IR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFFFFF" edc:_addr="0x42001C50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RF0N" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 New Message"/>
            <edc:SFRFieldDef edc:cname="RF0W" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="RF0F" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Full"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Message Lost"/>
            <edc:SFRFieldDef edc:cname="RF1N" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 New Message"/>
            <edc:SFRFieldDef edc:cname="RF1W" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="RF1F" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 FIFO Full"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Message Lost"/>
            <edc:SFRFieldDef edc:cname="HPM" edc:nzwidth="0x1" edc:desc="High Priority Message"/>
            <edc:SFRFieldDef edc:cname="TC" edc:nzwidth="0x1" edc:desc="Timestamp Completed"/>
            <edc:SFRFieldDef edc:cname="TCF" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished"/>
            <edc:SFRFieldDef edc:cname="TFE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty"/>
            <edc:SFRFieldDef edc:cname="TEFN" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry"/>
            <edc:SFRFieldDef edc:cname="TEFW" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="TEFF" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost"/>
            <edc:SFRFieldDef edc:cname="TSW" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound"/>
            <edc:SFRFieldDef edc:cname="MRAF" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure"/>
            <edc:SFRFieldDef edc:cname="TOO" edc:nzwidth="0x1" edc:desc="Timeout Occurred"/>
            <edc:SFRFieldDef edc:cname="DRX" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Rx Buffer"/>
            <edc:SFRFieldDef edc:cname="BEC" edc:nzwidth="0x1" edc:desc="Bit Error Corrected"/>
            <edc:SFRFieldDef edc:cname="BEU" edc:nzwidth="0x1" edc:desc="Bit Error Uncorrected"/>
            <edc:SFRFieldDef edc:cname="ELO" edc:nzwidth="0x1" edc:desc="Error Logging Overflow"/>
            <edc:SFRFieldDef edc:cname="EP" edc:nzwidth="0x1" edc:desc="Error Passive"/>
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Warning Status"/>
            <edc:SFRFieldDef edc:cname="BO" edc:nzwidth="0x1" edc:desc="Bus_Off Status"/>
            <edc:SFRFieldDef edc:cname="WDI" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEA" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase"/>
            <edc:SFRFieldDef edc:cname="PED" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase"/>
            <edc:SFRFieldDef edc:cname="ARA" edc:nzwidth="0x1" edc:desc="Access to Reserved Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="IE" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFFFFF" edc:_addr="0x42001C54">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RF0NE" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 New Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0WE" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0FE" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0LE" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Message Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1NE" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 New Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1WE" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1FE" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 FIFO Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1LE" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Message Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HPME" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:nzwidth="0x1" edc:desc="Timestamp Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCFE" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TFEE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFNE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFWE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFFE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFLE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TSWE" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MRAFE" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TOOE" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DRXE" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Rx Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BECE" edc:nzwidth="0x1" edc:desc="Bit Error Corrected Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BEUE" edc:nzwidth="0x1" edc:desc="Bit Error Uncorrected Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ELOE" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EPE" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EWE" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BOE" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WDIE" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEAE" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Enable"/>
            <edc:SFRFieldDef edc:cname="PEDE" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Enable"/>
            <edc:SFRFieldDef edc:cname="ARAE" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="ILS" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFFFFF" edc:_addr="0x42001C58">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RF0NL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0WL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0FL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0LL" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1NL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1WL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1FL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 FIFO Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1LL" edc:nzwidth="0x1" edc:desc="Rx FIFO 1 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="HPML" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCL" edc:nzwidth="0x1" edc:desc="Timestamp Completed Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCFL" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TFEL" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFNL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFWL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFLL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TSWL" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="MRAFL" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TOOL" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="DRXL" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Rx Buffer Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BECL" edc:nzwidth="0x1" edc:desc="Bit Error Corrected Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BEUL" edc:nzwidth="0x1" edc:desc="Bit Error Uncorrected Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="ELOL" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EPL" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EWL" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BOL" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="WDIL" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="PEAL" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Line"/>
            <edc:SFRFieldDef edc:cname="PEDL" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Line"/>
            <edc:SFRFieldDef edc:cname="ARAL" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Line"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="ILE" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x42001C5C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EINT0" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 0"/>
            <edc:SFRFieldDef edc:cname="EINT1" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x42001C60"/>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="GFC" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x42001C80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="RRFE" edc:nzwidth="0x1" edc:desc="Reject Remote Frames Extended"/>
            <edc:SFRFieldDef edc:cname="RRFS" edc:nzwidth="0x1" edc:desc="Reject Remote Frames Standard"/>
            <edc:SFRFieldDef edc:cname="ANFE" edc:nzwidth="0x2" edc:desc="Accept Non-matching Frames Extended">
              <edc:SFRFieldSemantic edc:cname="RXF0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RXF1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="REJECT1" edc:desc="Reject" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFS" edc:nzwidth="0x2" edc:desc="Accept Non-matching Frames Standard">
              <edc:SFRFieldSemantic edc:cname="RXF0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RXF1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="REJECT1" edc:desc="Reject" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="SIDFC" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42001C84">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="FLSSA" edc:nzwidth="0x10" edc:desc="Filter List Standard Start Address"/>
            <edc:SFRFieldDef edc:cname="LSS" edc:nzwidth="0x8" edc:desc="List Size Standard"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
